# coding: utf-8

from .获取材质 import 获取材质
from ..指针 import XiaoerMaterial

# 1.0.2增加"袖"，英文全部小写
# 1.0.3增加"声痕"、"body"、"发卡"
# 1.0.9增加"手套"
# 1.1.0增加"facial"、"臉"、"面甲"、"匕首"、"brow"、"pupil"、"duleface"、"发光"
表情关键词 = ["表情", "biaoq", "bq", "emo", "heart", "星", "star", "❤", "cheek", "nose", "脸红", "照れ", "> <", "声痕",
              "facial"]
脸部关键词 = ["脸", "臉", "颜", "顏", "面", "face"]
头发关键词 = ["发", "髪", "髮", "辫", "hair", "bang", "刘海", "后脑勺", "马尾", "馬尾"]
皮肤关键词 = ["首", "脖", "kubi", "皮肤", "肌", "skin", "體", "ear", "hou", "body"]
五官关键词 = ["眉", "mei", "brow", "睫", "jie", "二重", "bai", "眼", "目", "瞳", "eye", "Eye", "pupil", "hi", "yinying",
              "口", "嘴", "唇", "mouth", "kou", "lip", "牙", "齿", "齒", "teeth", "舌", "tongue", "she",
              "痣"]  # 注意芽衣英文名Mei
衣服关键词 = ["面具", "面罩", "面襯", "面甲", "神之眼", "眼罩", "眼镜", "饰", "飾", "绳", "繩", "纱", "紗", "带", "帶",
              "袖", "发卡", "手套", "匕首", "duleface", "发光"]

# 材质按名称分组，不一定分对
def 材质分类(模型, 材质集合=None):

    # 1.1.0fbx模型分离
    if not 材质集合:
        材质集合 = 获取材质(模型)

    脸 = next((材质 for 材质 in 材质集合 if any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 脸部关键词)), None)  # 1.0.3更新大小写匹配

    表情材质 = []
    头发材质 = []
    脸部材质 = []  # 有些模型将脸分成多个材质
    皮肤材质 = []
    五官材质 = []
    衣服材质 = []  # 反向过滤

    透明材质 = []  # 1.0.9检测透明材质  # 1.1.0改进为UV像素检测

    for 材质 in 材质集合:
        材质: XiaoerMaterial
        if 材质.小二预设模板.透明材质:
            透明材质.append(材质)
        if 材质.小二预设模板.材质分类:
            if   材质.小二预设模板.材质分类 == '脸部':
                脸部材质.append(材质)
            elif 材质.小二预设模板.材质分类 == '五官':
                五官材质.append(材质)
            elif 材质.小二预设模板.材质分类 == '表情':
                表情材质.append(材质)
            elif 材质.小二预设模板.材质分类 == '头发':
                头发材质.append(材质)
            elif 材质.小二预设模板.材质分类 == '皮肤':
                皮肤材质.append(材质)
            elif 材质.小二预设模板.材质分类 == '衣服':
                衣服材质.append(材质)
            continue  # 跳过后续判断

        是表情 = any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 表情关键词)
        是头发 = any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 头发关键词)
        是脸部 = any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 脸部关键词)
        是皮肤 = any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 皮肤关键词)
        是五官 = any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 五官关键词)
        是衣服 = any(关键词 in 材质.name or 关键词 in 材质.name.lower() for 关键词 in 衣服关键词)

        if   是衣服:
            衣服材质.append(材质)
            材质.小二预设模板.材质分类 = '衣服'
            材质.小二预设模板.更新分类 = '衣服'
            材质.小二预设模板.初始分类 = '衣服材质'
            continue  # 跳过后续判断
        if 是表情:
            表情材质.append(材质)
            材质.小二预设模板.材质分类 = '表情'
            材质.小二预设模板.更新分类 = '表情'
            材质.小二预设模板.初始分类 = '表情材质'
        elif 是头发:
            头发材质.append(材质)
            材质.小二预设模板.材质分类 = '头发'
            材质.小二预设模板.更新分类 = '头发'
            材质.小二预设模板.初始分类 = '头发材质'
        elif 是脸部:
            脸部材质.append(材质)
            材质.小二预设模板.材质分类 = '脸部'
            材质.小二预设模板.更新分类 = '脸部'
            材质.小二预设模板.初始分类 = '脸部材质'
        elif 是皮肤:
            皮肤材质.append(材质)
            材质.小二预设模板.材质分类 = '皮肤'
            材质.小二预设模板.更新分类 = '皮肤'
            材质.小二预设模板.初始分类 = '皮肤材质'
        elif 是五官:
            五官材质.append(材质)
            材质.小二预设模板.材质分类 = '五官'
            材质.小二预设模板.更新分类 = '五官'
            材质.小二预设模板.初始分类 = '五官材质'
        else:
            衣服材质.append(材质)
            材质.小二预设模板.材质分类 = '衣服'
            材质.小二预设模板.更新分类 = '衣服'
            材质.小二预设模板.初始分类 = '衣服材质'
    return 五官材质, 表情材质, 头发材质, 脸, 脸部材质, 皮肤材质, 衣服材质, 透明材质
