def 判断透明(self, 材质, 图像, 面像素点, 透明像素点, 完全透明像素点):
    # 菈乌玛头发贴图同时存在透明和不透明
    ## 材质Material["Alpha"] 透明占比 59.162% 树叶 透明材质
    ## 材质Material["饰"] 透明占比 73.272% 月之轮 非透明材质
    透明占比 = len(透明像素点 & 面像素点) / len(面像素点)
    self.report({"INFO"}, f'{图像.name}透明像素数量{len(透明像素点)}\n'
                          f'材质Material["{材质.name}"]面像素数量{len(面像素点)} 其中透明像素数量{len(透明像素点 & 面像素点)}\n'
                          f'透明占比 {透明占比:.3%}')
    if 透明像素点 & 面像素点 and not 面像素点 < 完全透明像素点:  # 材质面区域存在像素，并且材质非完全透明
        完全透明占比 = len(完全透明像素点 & 面像素点) / len(面像素点)
        self.report({"INFO"}, f'{图像.name}完全透明像素数量{len(完全透明像素点)}\n'
                              f'材质Material["{材质.name}"]完全透明像素数量{len(完全透明像素点 & 面像素点)}\n'
                              f'完全透明占比{完全透明占比:.3%}')
        # 菈乌玛头发贴图0.99 非透明材质
        # 第六夜想曲身体贴图0.98 非透明材质
        # 阿格莱雅头发贴图0.90 非透明材质
        # 菈乌玛身体贴图0.85 非透明材质
        # 菈乌玛月之轮0.73 非透明材质
        # 遐蝶身体贴图0.67 非透明材质
        # 海瑟音身体贴图0.60 非透明材质
        完全透明阈值 = 0.60
        # 菈乌玛树叶0.59 透明材质
        # 科拉莉「逆命魔龙·降临！」头发0.58 非透明材质
        # 遐蝶蝴蝶0.55 非透明材质
        # 知更鸟飘带0.53 非透明材质
        # 幻胧臂甲0.52 非透明材质
        # 芙宁娜髮2 0.42 非透明材质
        # 芙宁娜裙3 0.22 非透明材质
        if 完全透明占比 < 完全透明阈值:
            return True
        self.report({"INFO"}, f'材质Material["{材质.name}"]完全透明占比{完全透明占比}不小于{完全透明阈值}，非透明材质')
    elif not 透明像素点 & 面像素点:
        self.report({"INFO"}, f'材质Material["{材质.name}"]无透明像素，非透明材质')
    elif 面像素点 < 完全透明像素点:
        self.report({"INFO"}, f'材质Material["{材质.name}"]全部处于透明区域内，非透明材质')
    return False
