# coding: utf-8

import os, bpy
from ...指针 import XiaoerImage

def 获取AO贴图(游戏, 基础贴图:XiaoerImage) -> XiaoerImage|None:
    if 基础贴图.小二预设模板.类型:
        前缀 = 基础贴图.小二预设模板.前缀
        部件 = 基础贴图.小二预设模板.部件
        类型 = 基础贴图.小二预设模板.类型
        名称, 扩展 = os.path.splitext(基础贴图.name)  # 分割文件名和扩展名
###################################################################################################
        if 游戏 == "绝区零":
            新名 = f"{前缀}_{部件}_A{扩展}"
            AO贴图 = bpy.data.images.get(新名)
            return AO贴图
###################################################################################################
    return None
